In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("Mall_Customers.csv")
data.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [4]:
##Pre-processing data
data.isnull().sum()

CustomerID                0
Gender                    0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

In [5]:
#Split data into training and testing
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
data['Gender']= le.fit_transform(data["Gender"])
data.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1       1   19                  15                      39
1           2       1   21                  15                      81
2           3       0   20                  16                       6
3           4       0   23                  16                      77
4           5       0   31                  17                      40

In [6]:
from sklearn.preprocessing import StandardScaler
features = ['Age','Annual Income (k$)','Spending Score (1-100)','Gender']
x = data[features]

scaler = StandardScaler()
x_scaled = scaler.fit_transform(x)

In [ ]:
#making cluster
from sklearn.cluster import KMeans

k = 2
kmeans = KMeans(n_clusters=k, random_state=42)
data['Cluster'] = kmeans.fit_predict(x_scaled)

In [8]:
data.head()

,CustomerID,Gender,Age,Annual Income (k$),Spending Score (1-100),Cluster
0,1,1,19,15,39,1
1,2,1,21,15,81,1
2,3,0,20,16,6,0
3,4,0,23,16,77,0
4,5,0,31,17,40,0

In [11]:
#describe stat per cluster
display(data.groupby('Cluster')[features].mean())

               Age  Annual Income (k$)  Spending Score (1-100)  Gender
Cluster
0        38.098214           59.250000               51.526786     0.0
1        39.806818           62.227273               48.511364     1.0